* Plan

** TODO Further check the menu    :org-roam-capture-extension:
[2024-10-21 Mon 09:59] In file: [[file:///Users/ychu2/github/org-roam-capture-extension/background.js::85][background.js]]
#+BEGIN_SRC js2
browser.menus.create(
    {
        id: \"org-capture-selection\",
        title: \"Capture Selection\",
        contexts: [\"selection\"],
        documentUrlPatterns: [\"<all_urls>\"],  // \"https://*\" not works...
        icons: {
            \"16\": \"img/icon16.png\",
            \"32\": \"img/icon32.png\"
        }
    },
    () => {
        if (browser.runtime.lastError)
            console.log(`Error: ${browser.runtime.lastError}`)
    }
)


browser.menus.onClicked.addListener((info, tab) => {
    if (info.menuItemId === \"org-capture-selection\") {
        // console.log(info.selectionText);
        runScripts();
    }
});
#+END_SRC
** DONE Replace turndown with readability                             :PLAN:
CLOSED: [2024-10-22 Tue 09:54]
:LOGBOOK:
- State "DONE"       from "WORKING"    [2024-10-22 Tue 09:54]
- State "WORKING"    from "TODO"       [2024-10-22 Tue 09:26]
CLOCK: [2024-10-22 Tue 09:26]--[2024-10-22 Tue 09:54] =>  0:28
:END:
https://github.com/mozilla/readability
** DONE Check the popup func                                          :PLAN:
CLOSED: [2024-10-21 Mon 16:54]
:LOGBOOK:
- State "DONE"       from "WORKING"    [2024-10-21 Mon 16:54]
- State "WORKING"    from "TODO"       [2024-10-21 Mon 13:24]
CLOCK: [2024-10-21 Mon 13:24]--[2024-10-21 Mon 16:54] =>  3:30
:END:
** DONE Does api summarize requires the listener    :org-roam-capture-extension:
CLOSED: [2024-10-21 Mon 10:09]
:LOGBOOK:
- State "DONE"       from "HOLD"       [2024-10-21 Mon 10:09]
- State "HOLD"       from "WORKING"    [2024-10-21 Mon 10:08]
- State "WORKING"    from "TODO"       [2024-10-21 Mon 10:05]
CLOCK: [2024-10-21 Mon 10:05]--[2024-10-21 Mon 10:08] =>  0:03
:END:
[2024-10-21 Mon 10:04] In file: [[file:///Users/ychu2/github/org-roam-capture-extension/background.js::130][background.js]]
#+BEGIN_SRC js2
chrome.runtime.onMessage.addListener((request, sender, sendResponse) => {
  if (request.action === \"summarizeContent\") {
#+END_SRC

Not sure...

** WORKING Setup the background listener    :org-roam-capture-extension:
:LOGBOOK:
- State "WORKING"    from "TODO"       [2024-10-22 Tue 13:27]
CLOCK: [2024-10-22 Tue 13:27]
:END:
[2024-10-22 Tue 09:56] In file: [[file:///Users/ychu2/github/org-roam-capture-extension/capture.js::47][capture.js]]

** TODO Setup the popup.js and popup.html    :org-roam-capture-extension:
[2024-10-22 Tue 09:57] In file: [[file:///Users/ychu2/github/org-roam-capture-extension/capture.js::47][capture.js]]

** DONE Check the openai api    :org-roam-capture-extension:
CLOSED: [2024-10-22 Tue 10:57]
:LOGBOOK:
- State "DONE"       from "WORKING"    [2024-10-22 Tue 10:57]
- State "WORKING"    from "TODO"       [2024-10-22 Tue 10:47]
CLOCK: [2024-10-22 Tue 10:47]--[2024-10-22 Tue 10:57] =>  0:10
:END:
[2024-10-22 Tue 10:46] In file: [[file:///Users/ychu2/github/org-roam-capture-extension/background.js::141][background.js]]
#+BEGIN_SRC js2
  fetch(apiUrl, {
      method: \"POST\",
      headers: {
          \"Content-Type\": \"application/json\",
          Authorization: `Bearer ${apiKey}`,
      },
      body: JSON.stringify({
          model: model,
          prompt: prompt,
      }),
  })
#+END_SRC

* Note
